Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.sfn_attach_policy_schedule will be created
+ resource "aws_cloudwatch_event_rule" "sfn_attach_policy_schedule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "AttachSFNPolicyEvery12Hours"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(12 hours)"
      + tags_all            = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
    }

  # aws_cloudwatch_event_target.sfn_attach_policy_target will be created
+ resource "aws_cloudwatch_event_target" "sfn_attach_policy_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "AttachSFNPolicyEvery12Hours"
      + target_id      = "InvokeStartAutomationLambda"
    }

  # aws_iam_role_policy.lambda_ssm_automation will be created
+ resource "aws_iam_role_policy" "lambda_ssm_automation" {
      + id          = (known after apply)
      + name        = "LambdaSSMAutomationPolicy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:StartAutomationExecution"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "wrestleutopia_lambda_role"
    }

  # aws_lambda_function.put_sfn_schedule will be created
+ resource "aws_lambda_function" "put_sfn_schedule" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/put_sfn_schedule/put_sfn_schedule.zip"
      + function_name                  = "put_sfn_schedule"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::390402544450:role/wrestleutopia_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "K+I7EJ3mmWEcukV/BRSBeqYqFLt3+d+rMz1ghrDmAKk="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = "arn:aws:sqs:us-east-2:390402544450:wrestleutopia-lambda-dlq"
        }

      + environment {
          + variables = {
              + "AUTOMATION_ROLE"   = "arn:aws:iam::390402544450:role/SSMAutomationRole"
              + "POLICY_B64"        = "ewogICJWZXJzaW9uIjogIjIwMTItMTAtMTciLAogICJTdGF0ZW1lbnQiOiBbCiAgICB7CiAgICAgICJFZmZlY3QiOiAiQWxsb3ciLAogICAgICAiQWN0aW9uIjogInN0YXRlczpTdGFydEV4ZWN1dGlvbiIsCiAgICAgICJSZXNvdXJjZSI6ICJhd3Nfc2ZuX3N0YXRlX21hY2hpbmUubWFudWFsX3dvcmtmbG93LmFybiIsCiAgICAgICJQcmluY2lwYWwiOiB7CiAgICAgICAgIkFXUyI6IFsKICAgICAgICAgICJhcm46YXdzOmlhbTo6ODI1NzY1NDIyODU1OnJvbGUvc2hhcmVkc2VydmljZXNfbGFtYmRhX3JvbGUiLAogICAgICAgICAgImFybjphd3M6aWFtOjo4MjU3NjU0MjI4NTU6cm9sZS9Dcm9zc0FjY291bnRTdGFydEV4ZWN1dGlvblJvbGUiCiAgICAgICAgXQogICAgICB9CiAgICB9CiAgXQp9"
              + "RESOURCE_ARN"      = "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow"
              + "SSM_DOCUMENT_NAME" = "AttachSFNResourcePolicy"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_permission.allow_eventbridge_invoke will be created
+ resource "aws_lambda_permission" "allow_eventbridge_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "put_sfn_schedule"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowEventBridgeInvoke"
      + statement_id_prefix = (known after apply)
    }

  # aws_ssm_association.attach_policy_scheduled will be destroyed
  # (because aws_ssm_association.attach_policy_scheduled is not in configuration)
- resource "aws_ssm_association" "attach_policy_scheduled" {
      - apply_only_at_cron_interval      = false -> null
      - arn                              = "arn:aws:ssm:us-east-2:390402544450:association/05d33d76-c2d0-4a2e-818c-6d81cb80eacd" -> null
      - association_id                   = "05d33d76-c2d0-4a2e-818c-6d81cb80eacd" -> null
      - association_name                 = "AttachPolicyAutomation" -> null
      - document_version                 = "$DEFAULT" -> null
      - id                               = "05d33d76-c2d0-4a2e-818c-6d81cb80eacd" -> null
      - name                             = "AttachSFNResourcePolicy" -> null
      - parameters                       = {
          - "AutomationAssumeRole" = "arn:aws:iam::390402544450:role/SSMAutomationRole"
          - "PolicyB64"            = "ewogICJWZXJzaW9uIjogIjIwMTItMTAtMTciLAogICJTdGF0ZW1lbnQiOiBbCiAgICB7CiAgICAgICJFZmZlY3QiOiAiQWxsb3ciLAogICAgICAiQWN0aW9uIjogInN0YXRlczpTdGFydEV4ZWN1dGlvbiIsCiAgICAgICJSZXNvdXJjZSI6ICJhd3Nfc2ZuX3N0YXRlX21hY2hpbmUubWFudWFsX3dvcmtmbG93LmFybiIsCiAgICAgICJQcmluY2lwYWwiOiB7CiAgICAgICAgIkFXUyI6IFsKICAgICAgICAgICJhcm46YXdzOmlhbTo6ODI1NzY1NDIyODU1OnJvbGUvc2hhcmVkc2VydmljZXNfbGFtYmRhX3JvbGUiLAogICAgICAgICAgImFybjphd3M6aWFtOjo4MjU3NjU0MjI4NTU6cm9sZS9Dcm9zc0FjY291bnRTdGFydEV4ZWN1dGlvblJvbGUiCiAgICAgICAgXQogICAgICB9CiAgICB9CiAgXQp9"
          - "ResourceArn"          = "arn:aws:states:us-east-2:390402544450:stateMachine:manual_wrestleutopia_workflow"
        } -> null
      - schedule_expression              = "rate(12 hours)" -> null
      - tags                             = {} -> null
      - tags_all                         = {
          - "DeployedBy"  = "Terraform"
          - "Environment" = "prod"
          - "Project"     = "wrestleutopia"
        } -> null
        # (6 unchanged attributes hidden)

      - targets {
          - key    = "aws:NoOpAutomationTag" -> null
          - values = [
              - "AWS-NoOpAutomationTarget-Value",
            ] -> null
        }
    }

  # aws_ssm_document.attach_sfn_policy will be updated in-place
~ resource "aws_ssm_document" "attach_sfn_policy" {
      ~ content          = jsonencode(
          ~ {
              ~ assumeRole    = "{{AutomationAssumeRole}}" -> "{{ AutomationAssumeRole }}"
                # (4 unchanged attributes hidden)
            }
        )
      ~ default_version  = "11" -> (known after apply)
      ~ document_version = "11" -> (known after apply)
      ~ hash             = "d628266e93d1f6b9060bf4711ffaa07ed338e58fea1566ab51d86708ab056a64" -> (known after apply)
        id               = "AttachSFNResourcePolicy"
      ~ latest_version   = "11" -> (known after apply)
        name             = "AttachSFNResourcePolicy"
      ~ parameter        = [
          - {
              - name          = "ResourceArn"
              - type          = "String"
                # (2 unchanged attributes hidden)
            },
          - {
              - name          = "PolicyB64"
              - type          = "String"
                # (2 unchanged attributes hidden)
            },
          - {
              - name          = "AutomationAssumeRole"
              - type          = "String"
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
        tags             = {}
        # (14 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 5 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```